dongho23yenthanh-cyber/fugu-mppt-firmware/sdkconfig.defaults
CONFIG_FREERTOS_HZ=1000

# Smaller newlib printf/scanf (no 64-bit ints, no C99 %hh/%ll). ~40 KB flash.
# Format strings audited for %hh/%ll — narrow to 32-bit before re-introducing.
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y

CONFIG_AUTOSTART_ARDUINO=y

CONFIG_ARDUINO_RUNNING_CORE=0
CONFIG_ARDUINO_RUN_CORE0=y
CONFIG_ARDUINO_EVENT_RUNNING_CORE=0
CONFIG_ARDUINO_EVENT_RUN_CORE0=y
CONFIG_ARDUINO_SERIAL_EVENT_TASK_RUNNING_CORE=0
CONFIG_ARDUINO_SERIAL_EVENT_RUN_CORE0=y
CONFIG_ARDUINO_UDP_RUNNING_CORE=0
CONFIG_ARDUINO_UDP_RUN_CORE0=y

CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED=y
CONFIG_MQTT_USE_CORE_0=y


CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"


# CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024



# TODO reset on wd !
# NO! dont disable WD as it is usefull to discover spinlocks (IDLE tasks needed for OS housekeeping)
CONFIG_ESP_TASK_WDT_EN=y


# OTA: (NetworkClientSecure)
# this will significantly increase image size:
CONFIG_MBEDTLS_PSK_MODES=n #y
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=n #y

# OTA
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# Use the custom partitions.csv (set above), NOT the built-in two-OTA table. Leaving TWO_OTA=y here
# conflicts with CONFIG_PARTITION_TABLE_CUSTOM and a freshly generated sdkconfig resolves the choice
# to TWO_OTA, dropping the `littlefs` partition (build then fails creating the littlefs image).
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y # insecure

## Certificate bundle configuration
#CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
#CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE=y
#CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE_PATH="server_certs/ca_cert.pem"

# https://github.com/espressif/esp-idf/blob/v5.2.5/examples/system/ota/simple_ota_example/main/simple_ota_example.c


### perf
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n

# https://docs.espressif.com/projects/esp-idf/en/stable/esp32h2/api-guides/performance/speed.html#speed-targeted-optimizations
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x0
CONFIG_MDNS_TASK_AFFINITY_CPU0=y
CONFIG_MDNS_TASK_AFFINITY=0x0
CONFIG_PTHREAD_DEFAULT_CORE_NO_AFFINITY=0x0

# TODO switch RT_CORE to 0
# as for CONFIG_ESP_TIMER_ISR_AFFINITY=1 need CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL=y
CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL=y
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU1=y
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y


# PSRAM
#CONFIG_SPIRAM=y
#CONFIG_SPIRAM_USE_MALLOC=y
#CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y


CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE=y
# CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM=y


# disable speech recognigtion code
CONFIG_USE_WAKENET=n
CONFIG_USE_MULTINET=n


CONFIG_ARDUHAL_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_ARDUHAL_LOG_DEFAULT_LEVEL=2


# fix for ` undefined reference to `__wrap_esp_log_write'`:
CONFIG_DIAG_USE_EXTERNAL_LOG_WRAP=y


# Pin the primary build target so a freshly regenerated sdkconfig doesn't fall back to esp32
# (deleting sdkconfig + reconfigure otherwise picks the IDF default target). `idf.py set-target esp32`
# still overrides this for the alternate esp32 boards.
CONFIG_IDF_TARGET="esp32s3"

# Surfaced by `idf.py save-defconfig` as non-default — a RainMaker default pulled in transitively via
# arduino-esp32 (we don't use RainMaker). Captured here so a regenerated sdkconfig is reproducible.
CONFIG_ESP_RMAKER_ASSISTED_CLAIM=y


# --- BLE / NimBLE console (now compiled into every build) ---
# Moved here from sdkconfig.ble: the NimBLE stack is now part of the default config, so it is linked
# into all firmware. The BLE NUS console code (BleConsoleService / console_ble.*) is still gated at
# the source level by the WITH_BLE #ifdef. Flash cost: the OTA slot (partitions.csv) is ~1.87 MB and
# the BLE build is already ~1.86 MB — watch the headroom.
CONFIG_BT_ENABLED=y
# NimBLE host (smaller than Bluedroid); deselects Bluedroid via the Kconfig choice.
CONFIG_BT_NIMBLE_ENABLED=y
# Keep Bluetooth off the RT core. Core 1 is reserved for loopRT (ADC/MPPT/PWM); the controller
# ISR/task and the NimBLE host task live on core 0 like the rest of networking. Matches the current
# IDF default — kept explicit as a guard against future default changes.
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# Peripheral/broadcaster only (advertise + serve GATT; never scan or connect out). Dropping the
# central/observer roles and capping connections trims flash and RAM.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# Persist bonding keys (LTK/IRK) in NVS so a paired central reconnects after a reboot without
# re-pairing (default 'n' wipes bonds every boot -> stale central bond, reconnect fails).
CONFIG_BT_NIMBLE_NVS_PERSIST=y